import 'dart:math';

void main() {
  //Створіть список numbers зі 100 елементів.
  //Кожен елемент — випадкове число від 0 до 100
  //(використайте Random().nextInt(101)).
  final numbers = List.generate(100, (index) => Random().nextInt(101));

  //Виведіть цей список на екран.
  print('Весь список:');
  print(numbers);

  //Виведіть на екран 65-й елемент списку у форматі: "65-й елемент: [значення]".
  print('65-й елемент: ${numbers[64]}');

  //Вставте число 1000000000 на 50-ту позицію списку.
  //КОМЕНТАР (НЕ ШІ): З умови не зрозуміло, це заміна 50-го елементу
  //чи вставити на 50-те місце новий елемент.
  numbers[50] = 1000000000;

  //В другому випадку такий код підійшов би:
  //numbers.insert(50, 1000000000);

  //Видаліть зі списку елементи зі значеннями: 24, 45, 66, 88.
  //Видаляю ВСІ входження вказаних елементів:

  numbers.removeWhere((e) => e == 24);
  numbers.removeWhere((e) => e == 45);
  numbers.removeWhere((e) => e == 66);
  numbers.removeWhere((e) => e == 88);

  //За допомогою циклу for переберіть список. Під час перебору:
  //  - Порахуйте суму всіх елементів, що діляться на 3 без залишку.
  //  - Виведіть результат.

  // Цикл for з індексом
  var elementsDel3 = 0;
  for (var i = 0; i < numbers.length; i++) {
    if (numbers[i] % 3 == 0) {
      elementsDel3 = elementsDel3 + numbers[i];
    }
  }

  print('Сума елементів кратних 3: $elementsDel3');

  //Створіть порожній список temp. За допомогою циклу for-in переберіть numbers.
  //Додайте до temp лише ті елементи, що діляться на 2 без залишку.

  final temp = [];
  for (final element in numbers) {
    if (element % 2 == 0) {
      temp.add(element);
    }
  }

  //Виведіть довжину списку temp.

  print('Довжина списку temp: ${temp.length}');
  
  //print(temp);
}
